IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 WS-NAME PIC A(5) VALUE 'JAPAN'.
    01 WS-NUM1 PIC 9(3) VALUE 999.
    01 WS-NUM2 PIC S9(3)V9(2) VALUE 999.99.
    01 WS-CNT PIC 9(1) VALUE 1.
    01 WS-CNT2 PIC 9 VALUE 0.
    01 WS-STR1 PIC A(5) VALUE 'COBOL'.
    01 WS-STR2 PIC A(2) VALUE 'IS'.
    01 WS-STR3 PIC A(11) VALUE 'INTERESTING'.
    01 WS-STRING PIC A(18).
    01 WS-NUM3 PIC 9(4) VALUE 99.
    01 WS-NUM4 PIC 9(4) VALUE 99.
    01 WS-RESULT PIC 9(4).
PROCEDURE DIVISION.
DISPLAY "WS-NAME : "WS-NAME.
DISPLAY "WS-NUM1 : "WS-NUM1.
DISPLAY "WS-NUM2 : "WS-NUM2.

*>STRING CONCATENATION
STRING WS-STR1 DELIMITED BY SIZE
    WS-STR2 DELIMITED BY SIZE
    WS-STR3 DELIMITED BY SIZE
    INTO WS-STRING
END-STRING

DISPLAY WS-STRING.

*>PERFORM THRU LOOP.

PARA1.
PERFORM PARA2 THRU PARA5.

PARA2.
DISPLAY 'IN PARA2'.

PARA3. 
DISPLAY 'IN PARA3'.

PARA4.
DISPLAY 'IN PARA4'.

PARA5.
DISPLAY 'IN PARA5'.

*>PERFORM UNTIL LOOP p.s I think it deserves a A because I've never typed japanese into a program before :), plus i enjoy the language!

PARA6.
PERFORM PARA7 WITH TEST AFTER UNTIL WS-CNT>3.

PARA7.
DISPLAY '日本語上手! i.e "Good Japanese! :'WS-CNT.
ADD 1 TO WS-CNT.

*>PERFORM TIMES LOOP

PARA8.
PERFORM PARA9 5 TIMES.

PARA9.
DISPLAY 'HIIII!'.

*>PERFORM VARYING LOOP

PARA10.
PERFORM PARA11 VARYING WS-CNT2 FROM 1 BY 1 UNTIL WS-CNT2=3.

PARA11.
DISPLAY 'PARA11 : 'WS-CNT2.

*>DISPLAY OF FUNCTION

PERFORM ADD-PARA.

DISPLAY WS-RESULT.

*>MULTIPARAMETER FUNCTION

ADD-PARA SECTION.
    ADD WS-NUM3 TO WS-NUM4 GIVING WS-RESULT.
    EXIT.





